#+title: Interacting With Git via HTTP
#+subtitle: Looking at git http traffic
#+date: 2021-02-11
#+tags[]: git
#+aliases[]: /articles/2021/interacting_with_git_via_http

Git continually impresses me.  I've gone down a bit of a rabbit hole
with how it works, and it's just a delight.  I want to find a good way
to see if a git repo changed, and I wonder if there's a way to do this
using http directly, and there is.

** Then clone

#+begin_src bash
git clone https://github.com/wschenk/willschenk.com/
#+end_src

Now we can see that

#+ATTR_HTML: :class table table-striped
| request url | GET https://github.com/wschenk/willschenk.com/info/refs?service=git-upload-pack HTTP/2.0 |
| user agent  | git/2.20.1                                                                               |
| accepts     | **/**                                                                                      |

And it returns a binary file format of type
=application/x-git-upload-pack-advertisement=

We can kill our docker containers, and save the file to start parsing!

Note that github anyway looks at the user agent to determine what to
serve, not the =Accept= header:

#+begin_src bash :results output
curl -H "Accept: */*" https://github.com/wschenk/willschenk.com/info/refs?service=git-upload-pack
#+end_src

#+RESULTS:
: Not Found

So use =-A= to download the data.

#+begin_src bash :results output
  curl -A "git/2.20.1" --output ref.bin https://github.com/wschenk/willschenk.com/info/refs?service=git-upload-pack
  ls -l ref.bin
#+end_src

#+RESULTS:
: -rw-r--r-- 1 wschenk wschenk 2223 Feb 11 16:55 ref.bin

